In [10]:
!cd data
!pwd
!ls

/Users/pranayvaddepalli/Desktop/Exercise files
Day1.ipynb             Home work.ipynb        Pandas - 2 .ipynb
Day2.ipynb             LOOPS.ipynb            Pandas day-1.ipynb
Day3.ipynb             Modules.ipynb          Pandas3.ipynb
Day4.ipynb             Numpy - 1.ipynb        Technologyforall.ipynb
Flask-app_3_and_4      Numpy - 2.ipynb        data
Functions.ipynb        OOPS.ipynb

In [11]:
    import pandas as pd
    import numpy as np

df = pd.read_csv('data/Iris.csv')

df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [12]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [14]:
df.head(2)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa

In [13]:
df.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [15]:
df.tail(2)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [31]:
df.shape

(150, 6)

In [30]:
df.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [29]:
df.mean()

Id               75.500000
SepalLengthCm     5.843333
SepalWidthCm      3.054000
PetalLengthCm     3.758667
PetalWidthCm      1.198667
dtype: float64

In [28]:
df.median()

Id               75.50
SepalLengthCm     5.80
SepalWidthCm      3.00
PetalLengthCm     4.35
PetalWidthCm      1.30
dtype: float64

In [27]:
df.mode()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.0,3.0,1.5,0.2,Iris-setosa
1,2,NaN,NaN,NaN,NaN,Iris-versicolor
2,3,NaN,NaN,NaN,NaN,Iris-virginica
3,4,NaN,NaN,NaN,NaN,NaN
4,5,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
145,146,NaN,NaN,NaN,NaN,NaN
146,147,NaN,NaN,NaN,NaN,NaN
147,148,NaN,NaN,NaN,NaN,NaN
148,149,NaN,NaN,NaN,NaN,NaN
149,150,NaN,NaN,NaN,NaN,NaN

In [26]:
df.std()

Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
dtype: float64

In [25]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [32]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

# Weather Dataset

In [34]:
import pandas as pd

df = pd.read_csv('data/nyc_weather.csv')
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [40]:
#What is the max temperature

df['Temperature'].max()

50

In [36]:
df.Temperature.max()

50

In [38]:
df.DewPoint.min()

-3

In [42]:
# Select row with max temperature
df[df.Temperature == df.Temperature.max()]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [44]:
# Extract 25 Temperature data

df[df.Temperature == 25]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293

In [52]:
# Which day it rains?

# df['EST'][df.Events == 'Rain' ]
df.EST[df.Events == 'Rain' ]

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

# Working with .xlsx

In [54]:
import pandas as pd

df = pd.read_excel('data/weather_data.xlsx')

df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

# DataFrame to .csv & .xlsx

In [60]:
import pandas as pd
import numpy as np

#Create Dictionary of Series

dict = {'Name':pd.Series(['Tom', 'Jack', 'Steve', 'Ricky', 'Vin', 'James', 'Smith']),
        'Age':pd.Series([25,26,43,56,43,65,54]),
        'Rating':pd.Series([4.23,4.1,3.4,5,2.9,4.7,3.1])}

df = pd.DataFrame(dict)

df

    Name  Age  Rating
0    Tom   25    4.23
1   Jack   26    4.10
2  Steve   43    3.40
3  Ricky   56    5.00
4    Vin   43    2.90
5  James   65    4.70
6  Smith   54    3.10

In [62]:
# Write DataFrame to .csv

df.to_csv('data/temp/new_csv_file.csv')

In [63]:
# Write DataFrame to .csv without index

df.to_csv('data/temp/new_csv_file_1.csv', index=False)

In [65]:
# Write DataFrame to .xlsx

df.to_excel('data/temp/new_excel_file.xlsx', sheet_name='student data')

In [66]:
# Write DataFrame to .xlsx without index

df.to_excel('data/temp/new_excel_file_1.xlsx', sheet_name='student data', index=False)

In [67]:
!ls

Day1.ipynb             Home work.ipynb        Pandas - 2 .ipynb
Day2.ipynb             LOOPS.ipynb            Pandas day-1.ipynb
Day3.ipynb             Modules.ipynb          Pandas3.ipynb
Day4.ipynb             Numpy - 1.ipynb        Technologyforall.ipynb
Flask-app_3_and_4      Numpy - 2.ipynb        data
Functions.ipynb        OOPS.ipynb

In [69]:
!cd data
!ls

Day1.ipynb             Home work.ipynb        Pandas - 2 .ipynb
Day2.ipynb             LOOPS.ipynb            Pandas day-1.ipynb
Day3.ipynb             Modules.ipynb          Pandas3.ipynb
Day4.ipynb             Numpy - 1.ipynb        Technologyforall.ipynb
Flask-app_3_and_4      Numpy - 2.ipynb        data
Functions.ipynb        OOPS.ipynb

In [71]:
import pandas as pd

df = pd.read_csv('data/temp/new_csv_file_1.csv')

df

    Name  Age  Rating
0    Tom   25    4.23
1   Jack   26    4.10
2  Steve   43    3.40
3  Ricky   56    5.00
4    Vin   43    2.90
5  James   65    4.70
6  Smith   54    3.10

In [76]:
import pandas as pd
df = pd.read_excel('data/temp/new_excel_file_1.xlsx')
df

    Name  Age  Rating
0    Tom   25    4.23
1   Jack   26    4.10
2  Steve   43    3.40
3  Ricky   56    5.00
4    Vin   43    2.90
5  James   65    4.70
6  Smith   54    3.10